using GD_STD.Attribute;
using System;

namespace GD_STD.Enum
{
    /// <summary>
    /// Codesys 錯誤代碼
    /// </summary>
    public enum ERROR_CODE : Int16
    {
        #region 機械
        /// <summary>
        /// 沒有錯誤代碼
        /// </summary>
        [Codesys("沒有錯誤代碼")]
        Null,
        /// <summary>
        /// 左進料刀庫1與設定不符
        /// </summary>
        /// <remarks>
        /// 左軸入料口刀庫第 "1" 把軟體設定不相符, 請檢查左軸入料口刀庫，是否與應用程式之設定相符。排解完畢請按下警報復位
        /// </remarks>
        [Codesys("左軸入料口刀庫第 \"1\" 把軟體設定不相符", "請檢查左軸入料口刀庫，是否與應用程式之設定相符。\n排解完畢請按下警報復位")]
        L_IN_DrillHome1,
        /// <summary>
        /// 左進料刀庫2與設定不符
        /// </summary>
        /// <remarks>
        /// 左軸入料口刀庫第 "2" 把軟體設定不相符, 請檢查左軸入料口刀庫，是否與應用程式之設定相符。排解完畢請按下警報復位
        /// </remarks>
        [Codesys("左軸入料口刀庫第 \"2\" 把軟體設定不相符", "請檢查左軸入料口刀庫，是否與應用程式之設定相符。\n排解完畢請按下警報復位")]
        L_IN_DrillHome2,
        /// <summary>
        /// 左進料刀庫3與設定不符
        /// </summary>
        /// <remarks>
        /// 左軸入料口刀庫第 "3" 把軟體設定不相符, 請檢查左軸入料口刀庫，是否與應用程式之設定相符。排解完畢請按下警報復位
        /// </remarks>
        [Codesys("左軸入料口刀庫第 \"3\" 把軟體設定不相符", "請檢查左軸入料口刀庫，是否與應用程式之設定相符。\n排解完畢請按下警報復位")]
        L_IN_DrillHome3,
        /// <summary>
        /// 左進料刀庫4與設定不符
        /// </summary>
        /// <remarks>
        /// 左軸入料口刀庫第 "4" 把軟體設定不相符, 請檢查左軸入料口刀庫，是否與應用程式之設定相符。排解完畢請按下警報復位
        /// </remarks>
        [Codesys("左軸入料口刀庫第 \"4\" 把軟體設定不相符", "請檢查左軸入料口刀庫，是否與應用程式之設定相符。\n排解完畢請按下警報復位")]
        L_IN_DrillHome4,
        /// <summary>
        /// 左出料刀庫1與設定不符
        /// </summary>
        /// <remarks>
        /// 左軸出料口刀庫第 "1" 把軟體設定不相符, 請檢查左軸出料口刀庫，是否與應用程式之設定相符。排解完畢請按下警報復位
        /// </remarks>
        [Codesys("左軸出料口刀庫第 \"1\" 把軟體設定不相符", "請檢查左軸出料口刀庫，是否與應用程式之設定相符。\n排解完畢請按下警報復位")]
        L_Out_DrillHome1,
        /// <summary>
        /// 左出料刀庫2與設定不符
        /// </summary>
        /// <remarks>
        /// 左軸出料口刀庫第 "2" 把軟體設定不相符, 請檢查左軸出料口刀庫，是否與應用程式之設定相符。排解完畢請按下警報復位
        /// </remarks>
        [Codesys("左軸出料口刀庫第 \"2\" 把軟體設定不相符", "請檢查左軸出料口刀庫，是否與應用程式之設定相符。\n排解完畢請按下警報復位")]
        L_Out_DrillHome2,
        /// <summary>
        /// 左軸出料口刀庫第 "3" 把軟體設定不相符, 請檢查左軸出料口刀庫，是否與應用程式之設定相符。排解完畢請按下警報復位
        /// </summary>
        [Codesys("左軸出料口刀庫第 \"3\" 把軟體設定不相符", "請檢查左軸出料口刀庫，是否與應用程式之設定相符。\n排解完畢請按下警報復位")]
        L_Out_DrillHome3,
        /// <summary>
        /// 左出料刀庫4與設定不符
        /// </summary>
        /// <remarks>
        /// 左軸出料口刀庫第 "4" 把軟體設定不相符, 請檢查左軸出料口刀庫，是否與應用程式之設定相符。排解完畢請按下警報復位
        /// </remarks>
        [Codesys("左軸出料口刀庫第 \"4\" 把軟體設定不相符", "請檢查左軸出料口刀庫，是否與應用程式之設定相符。\n排解完畢請按下警報復位")]
        L_Out_DrillHome4,
        /// <summary>
        /// 右進料刀庫1與設定不符
        /// </summary>
        /// <remarks>
        /// 右軸入料口刀庫第 "1" 把軟體設定不相符, 請檢查右軸入料口刀庫，是否與應用程式之設定相符。排解完畢請按下警報復位
        /// </remarks>
        [Codesys("右軸入料口刀庫第 \"1\" 把軟體設定不相符", "請檢查右軸入料口刀庫，是否與應用程式之設定相符。\n排解完畢請按下警報復位")]
        R_IN_DrillHome1,
        /// <summary>
        /// 右進料刀庫1與設定不符
        /// </summary>
        /// <remarks>
        /// 右軸入料口刀庫第 "2" 把軟體設定不相符, 請檢查右軸入料口刀庫，是否與應用程式之設定相符。排解完畢請按下警報復位
        /// </remarks>
        [Codesys("右軸入料口刀庫第 \"2\" 把軟體設定不相符", "請檢查右軸入料口刀庫，是否與應用程式之設定相符。\n排解完畢請按下警報復位")]
        R_IN_DrillHome2,
        /// <summary>
        /// 右進料刀庫1與設定不符
        /// </summary>
        /// <remarks>
        /// 右軸入料口刀庫第 "3" 把軟體設定不相符, 請檢查右軸入料口刀庫，是否與應用程式之設定相符。排解完畢請按下警報復位
        /// </remarks>
        [Codesys("右軸入料口刀庫第 \"3\" 把軟體設定不相符", "請檢查右軸入料口刀庫，是否與應用程式之設定相符。\n排解完畢請按下警報復位")]
        R_IN_DrillHome3,
        /// <summary>
        /// 右進料刀庫1與設定不符
        /// </summary>
        /// <remarks>
        /// 右軸入料口刀庫第 "4" 把軟體設定不相符, 請檢查右軸入料口刀庫，是否與應用程式之設定相符。排解完畢請按下警報復位
        /// </remarks>
        [Codesys("右軸入料口刀庫第 \"4\" 把軟體設定不相符", "請檢查右軸入料口刀庫，是否與應用程式之設定相符。\n排解完畢請按下警報復位")]
        R_IN_DrillHome4,
        /// <summary>
        /// 右出料刀庫1與設定不符
        /// </summary>
        /// <remarks>
        /// 右軸出料口刀庫第 "1" 把軟體設定不相符, 請檢查右軸出料口刀庫，是否與應用程式之設定相符。排解完畢請按下警報復位
        /// </remarks>
        [Codesys("右軸出料口刀庫第 \"1\" 把軟體設定不相符", "請檢查右軸出料口刀庫，是否與應用程式之設定相符。\n排解完畢請按下警報復位")]
        R_Out_DrillHome1,
        /// <summary>
        /// 右出料刀庫2與設定不符
        /// </summary>
        ///<remarks>
        ///右軸出料口刀庫第 "2" 把軟體設定不相符, 請檢查右軸出料口刀庫，是否與應用程式之設定相符。排解完畢請按下警報復位
        ///</remarks>
        [Codesys("右軸出料口刀庫第 \"2\" 把軟體設定不相符", "請檢查右軸出料口刀庫，是否與應用程式之設定相符。\n排解完畢請按下警報復位")]
        R_Out_DrillHome2,
        /// <summary>
        /// 右出料刀庫3與設定不符
        /// </summary>
        /// <remarks>
        /// 右軸出料口刀庫第 "3" 把軟體設定不相符, 請檢查右軸出料口刀庫，是否與應用程式之設定相符。排解完畢請按下警報復位
        /// </remarks>
        [Codesys("右軸出料口刀庫第 \"3\" 把軟體設定不相符", "請檢查右軸出料口刀庫，是否與應用程式之設定相符。\n排解完畢請按下警報復位")]
        R_Out_DrillHome3,
        /// <summary>
        /// 右出料刀庫4與設定不符
        /// </summary>
        /// <remarks>
        /// 右軸出料口刀庫第 "4" 把軟體設定不相符, 請檢查右軸出料口刀庫，是否與應用程式之設定相符。排解完畢請按下警報復位
        /// </remarks>
        [Codesys("右軸出料口刀庫第 \"4\" 把軟體設定不相符", "請檢查右軸出料口刀庫，是否與應用程式之設定相符。\n排解完畢請按下警報復位")]
        R_Out_DrillHome4,
        /// <summary>
        /// 中軸刀庫1與設定不符
        /// </summary>
        /// <remarks>
        /// 中軸口刀庫第 "1" 把軟體設定不相符, 請檢查中軸口刀庫，是否與應用程式之設定相符。排解完畢請按下警報復位
        /// </remarks>
        [Codesys("中軸口刀庫第 \"1\" 把軟體設定不相符", "請檢查中軸口刀庫，是否與應用程式之設定相符。\n排解完畢請按下警報復位")]
        M_DrillHome1,
        /// <summary>
        /// 中軸刀庫2與設定不符
        /// </summary>
        /// <remarks>
        /// 中軸口刀庫第 "2" 把軟體設定不相符, 請檢查中軸口刀庫，是否與應用程式之設定相符。排解完畢請按下警報復位
        /// </remarks>
        [Codesys("中軸口刀庫第 \"2\" 把軟體設定不相符", "請檢查中軸口刀庫，是否與應用程式之設定相符。\n排解完畢請按下警報復位")]
        M_DrillHome2,
        /// <summary>
        /// 中軸刀庫3與設定不符
        /// </summary>
        /// <remarks>
        /// 中軸口刀庫第 "3" 把軟體設定不相符, 請檢查中軸口刀庫，是否與應用程式之設定相符。排解完畢請按下警報復位
        /// </remarks>
        [Codesys("中軸口刀庫第 \"3\" 把軟體設定不相符", "請檢查中軸口刀庫，是否與應用程式之設定相符。\n排解完畢請按下警報復位")]
        M_DrillHome3,
        /// <summary>
        /// 中軸刀庫4與設定不符
        /// </summary>
        /// <remarks>
        /// 中軸口刀庫第 "4" 把軟體設定不相符, 請檢查中軸口刀庫，是否與應用程式之設定相符。排解完畢請按下警報復位
        /// </remarks>
        [Codesys("中軸口刀庫第 \"4\" 把軟體設定不相符", "請檢查中軸口刀庫，是否與應用程式之設定相符。\n排解完畢請按下警報復位")]
        M_DrillHome4,
        /// <summary>
        /// 中軸刀庫5與設定不符
        /// </summary>
        /// <remarks>
        /// 中軸口刀庫第 "5" 把軟體設定不相符, 請檢查中軸口刀庫，是否與應用程式之設定相符。排解完畢請按下警報復位
        /// </remarks>
        [Codesys("中軸口刀庫第 \"5\" 把軟體設定不相符", "請檢查中軸口刀庫，是否與應用程式之設定相符。\n排解完畢請按下警報復位")]
        M_DrillHome5,
        /// <summary>
        /// 軸向左與中即將碰撞
        /// </summary>
        /// <remarks>
        /// 軸向左與中即將碰撞，請原點復歸，排解完畢請按下警報復位
        /// </remarks>
        [Codesys("軸向左與中即將碰撞", "請原點復歸，\n排解完畢請按下警報復位")]
        Axis_LAndM_Touch,
        /// <summary>
        /// 軸向中與右即將碰撞
        /// </summary>
        /// <remarks>
        /// 軸向中與右即將碰撞，請原點復歸，排解完畢請按下警報復位
        /// </remarks>
        [Codesys("軸向中與右即將碰撞", "請原點復歸，\n排解完畢請按下警報復位")]
        Axis_MAndR_Touch,
        /// <summary>
        /// 軸向左與右即將碰撞
        /// </summary>
        /// <remarks>
        /// 軸向左與右即將碰撞, 請原點復歸，排解完畢請按下警報復位
        /// </remarks>
        [Codesys("軸向左與右即將碰撞", "請原點復歸，\n排解完畢請按下警報復位")]
        Axis_LAndR_Touch,
        /// <summary>
        /// 自動模式下不再原點
        /// </summary>
        /// <remarks>
        /// 自動模式下不再原點, 請先轉到手動模式下，在原點復歸。排解完畢請按下警報復位
        /// </remarks>
        [Codesys("自動模式下不再原點", "請先轉到手動模式下，在原點復歸。\n排解完畢請按下警報復位")]
        AutoNotOnOrigin,
        /// <summary>
        /// EtherCAT 通訊連線錯誤
        /// </summary>
        /// <remarks>
        /// EtherCAT 通訊連線錯誤, 請耐心等候系統 Reset 。如還有問題請聯絡廣達機械國際有限公司
        /// </remarks>
        [Codesys("EtherCAT 通訊連線錯誤", "請耐心等候系統 Reset 。\n如還有問題請聯絡廣達機械國際有限公司")]
        EtherCAT,
        /// <summary>
        /// 左X負極限觸發
        /// </summary>
        /// <remarks>
        /// 左X負極限觸發，請原點復歸，排解完畢請按下警報復位。如還有問題請聯絡廣達機械國際有限公司
        /// </remarks>
        [Codesys("左X負極限觸發，請原點復歸，\n排解完畢請按下警報復位。\n如還有問題請聯絡廣達機械國際有限公司")]
        L_X_LimitBack,
        /// <summary>
        /// 左Y負極限觸發
        /// </summary>
        /// <remarks>
        /// 左Y負極限觸發，請原點復歸，排解完畢請按下警報復位。如還有問題請聯絡廣達機械國際有限公司
        /// </remarks>
        [Codesys("左Y負極限觸發，請原點復歸，\n排解完畢請按下警報復位。\n如還有問題請聯絡廣達機械國際有限公司")]
        L_Y_LimitBack,
        /// <summary>
        /// 左Y正極限觸發
        /// </summary>
        /// <remarks>
        /// 左Y正極限觸發，請原點復歸，排解完畢請按下警報復位。如還有問題請聯絡廣達機械國際有限公司
        /// </remarks>
        [Codesys("左Y正極限觸發，請原點復歸，\n排解完畢請按下警報復位。\n如還有問題請聯絡廣達機械國際有限公司")]
        L_Y_LimitFront,
        /// <summary>
        /// 左Z負極限觸發
        /// </summary>
        /// <remarks>
        /// 左Z負極限觸發，請原點復歸，排解完畢請按下警報復位。如還有問題請聯絡廣達機械國際有限公司
        /// </remarks>
        [Codesys("左Z負極限觸發，請原點復歸，\n排解完畢請按下警報復位。\n如還有問題請聯絡廣達機械國際有限公司")]
        L_Z_LimitBack,
        /// <summary>
        /// 左Z正極限觸發
        /// </summary>
        /// <remarks>
        /// 左Z正極限觸發，請原點復歸，排解完畢請按下警報復位。如還有問題請聯絡廣達機械國際有限公司
        /// </remarks>
        [Codesys("左Z正極限觸發，請原點復歸，\n排解完畢請按下警報復位。\n如還有問題請聯絡廣達機械國際有限公司")]
        L_Z_LimitFornt,
        /// <summary>
        /// 右X負極限觸發
        /// </summary>
        /// 右X負極限觸發，請原點復歸，排解完畢請按下警報復位。如還有問題請聯絡廣達機械國際有限公司
        [Codesys("右X負極限觸發，請原點復歸，\n排解完畢請按下警報復位。\n如還有問題請聯絡廣達機械國際有限公司")]
        R_X_LimitBack,
        /// <summary>
        /// 右X正極限觸發
        /// </summary>
        /// <remarks>
        /// 右X正極限觸發，請原點復歸，排解完畢請按下警報復位。如還有問題請聯絡廣達機械國際有限公司
        /// </remarks>
        [Codesys("右X正極限觸發，請原點復歸，\n排解完畢請按下警報復位。\n如還有問題請聯絡廣達機械國際有限公司")]
        R_X_LimitFornt,
        /// <summary>
        /// 右Y負極限觸發
        /// </summary>
        /// <remarks>
        /// 右Y負極限觸發，請原點復歸，排解完畢請按下警報復位。如還有問題請聯絡廣達機械國際有限公司
        /// </remarks>
        [Codesys("右Y負極限觸發，請原點復歸，\n排解完畢請按下警報復位。\n如還有問題請聯絡廣達機械國際有限公司")]
        R_Y_LimitBack,
        /// <summary>
        /// 右Y正極限觸發
        /// </summary>
        /// <remarks>
        /// 右Y正極限觸發，請原點復歸，排解完畢請按下警報復位。如還有問題請聯絡廣達機械國際有限公司
        /// </remarks>
        [Codesys("右Y正極限觸發，請原點復歸，\n排解完畢請按下警報復位。\n如還有問題請聯絡廣達機械國際有限公司")]
        R_Y_LimitFornt,
        /// <summary>
        /// 右Z負極限觸發
        /// </summary>
        /// <remarks>
        /// 右Z負極限觸發，請原點復歸，排解完畢請按下警報復位。如還有問題請聯絡廣達機械國際有限公司
        /// </remarks>
        [Codesys("右Z負極限觸發，請原點復歸，\n排解完畢請按下警報復位。\n如還有問題請聯絡廣達機械國際有限公司")]
        R_Z_LimitBack,
        /// <summary>
        /// 右Z正極限觸發
        /// </summary>
        /// <remarks>
        /// 右Z正極限觸發，請原點復歸，排解完畢請按下警報復位。如還有問題請聯絡廣達機械國際有限公司
        /// </remarks>
        [Codesys("右Z正極限觸發，請原點復歸，\n排解完畢請按下警報復位。\n如還有問題請聯絡廣達機械國際有限公司")]
        R_Z_LimitFornt,
        /// <summary>
        /// 上X負極限處發
        /// </summary>
        /// <remarks>
        /// 上X負極限處發，請原點復歸，排解完畢請按下警報復位。如還有問題請聯絡廣達機械國際有限公司
        /// </remarks>
        [Codesys("上X負極限處發，請原點復歸，\n排解完畢請按下警報復位。\n如還有問題請聯絡廣達機械國際有限公司")]
        M_X_LimitBack,
        /// <summary>
        /// 上X正極限觸發
        /// </summary>
        /// <remarks>
        /// 上X正極限觸發，請原點復歸，排解完畢請按下警報復位。如還有問題請聯絡廣達機械國際有限公司
        /// </remarks>
        [Codesys("上X正極限觸發，請原點復歸，\n排解完畢請按下警報復位。\n如還有問題請聯絡廣達機械國際有限公司")]
        M_X_LimitFornt,
        /// <summary>
        /// 上Y負極限觸發
        /// </summary>
        /// <remarks>
        /// 上Y負極限觸發，請原點復歸，排解完畢請按下警報復位。如還有問題請聯絡廣達機械國際有限公司
        /// </remarks>
        [Codesys("上Y負極限觸發，請原點復歸，\n排解完畢請按下警報復位。\n如還有問題請聯絡廣達機械國際有限公司")]
        M_Y_LimitBack,
        /// <summary>
        /// 上Y正極限觸發
        /// </summary>
        /// <remarks>
        /// 上Y正極限觸發，請原點復歸，\n排解完畢請按下警報復位。\n如還有問題請聯絡廣達機械國際有限公司
        /// </remarks>
        [Codesys("上Y正極限觸發，請原點復歸，\n排解完畢請按下警報復位。\n如還有問題請聯絡廣達機械國際有限公司")]
        M_Y_LimitFornt,
        /// <summary>
        /// 上Z負極限觸發
        /// </summary>
        /// <remarks>
        /// 上Z負極限觸發，請原點復歸，排解完畢請按下警報復位。如還有問題請聯絡廣達機械國際有限公司
        /// </remarks>
        [Codesys("上Z負極限觸發，請原點復歸，\n排解完畢請按下警報復位。\n如還有問題請聯絡廣達機械國際有限公司")]
        M_Z_LimitBack,
        /// <summary>
        /// 上Z正極限觸發
        /// </summary>
        /// <remarks>
        /// 上Z正極限觸發，請原點復歸，排解完畢請按下警報復位。如還有問題請聯絡廣達機械國際有限公司
        /// </remarks>
        [Codesys("上Z正極限觸發，請原點復歸，\n排解完畢請按下警報復位。\n如還有問題請聯絡廣達機械國際有限公司")]
        M_Z_LimitFornt,
        #endregion

        #region 手機 Error
        /// <summary>
        /// 行動裝置手動功能操作失敗
        /// </summary>
        /// <remarks>
        /// 行動裝置手動功能操作失敗，請將鑰匙轉到手動，再重新操作。如還有問題請聯絡廣達機械國際有限公司
        /// </remarks>
        [Codesys("行動裝置手動操作失敗，請將鑰匙轉到手動，再重新操作。\n如還有問題請聯絡廣達機械國際有限公司")]
        Phone_Key_Manual = 10000 ,
        /// <summary>
        /// 行動裝置手動功能操作失敗
        /// </summary>
        /// <remarks>
        /// 行動裝置手動功能操作失敗，目前機器正在執行工作，請等待機器工作執行完畢，再重新操作此功能。如還有問題請聯絡廣達機械國際有限公司
        /// </remarks>
        [Codesys("行動裝置手動功能操作失敗，目前機器正在執行工作，請等待機器工作執行完畢，再重新操作此功能。\n如還有問題請聯絡廣達機械國際有限公司")]
        Phone_Codesys_Run,
        #endregion
    }
}
